<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <!-- Add css -->
    <link href="assets/css/main.css" type="text/css" rel="stylesheet">
    <!-- Add fonts -->
    <link href="https://allfont.ru/allfont.css?fonts=garamond" rel="stylesheet" type="text/css" />
    <title>All</title>
</head>
<body>
<!-- Head of site/menu nav -->
<header id="header">
    <nav>
            <ul>
                <li>
                    <a href="">Logo</a>
                </li>
                <li>
                    <a href="">About</a>
                </li>
                <li>
                    <a href="authorization.php">LogIn</a>
                </li>
            </ul>
    </nav>
</header>
<!-- Main block -->
<main>
    <!-- Output of all articles -->
    <article>
        <div class="container">
            <h1>Article title</h1>
            <div class="article-img"><img src="assets/img/post.webp" alt="article image"></div>
            <div class="article-info">
                <div>Author: Stas Asket</div>
                <div>Date of publication: 15.02.2023</div>
                <div class="container-short-text">
                    <div class="truncate-text">Content: Дунфан Сяньюнь имел за плечами богатую жуткую историю. Парень оказался в мире не просто боевых искусств, а ещё и магии. Он принимал Фэй Синя за брата по секте Беспечности, а тот повелся преступным образом, столкнувши Дунфана с горы, а тот не погиб. Он встретил невероятную девушку, заставившую его стать злодеем. Когда-то он ощущал, что настало его время стать крутым, как всегда и мечтал. Он даже полагал, что станет рулить важной сектой. Никто не мог ему помочь. Он был загнан в угол. Ему не удалось победить главу семьи на высочайшем уровне духовного развития. В общем-то, проблем у парня было в избытке, и он уже подумал, что и в этот раз погибнет. Члены секты прибыли к городу, где находился штаб секты Соблазна. Нангун готова была к кардинальным мерам, но ответственный за миссию, сдерживает её пыл. Дунфан сталкивается с врагом. А тот был намного сильнее, и Дунфан пал наземь, а из домов стали выходить расстроенные люди, переживая за него. Они кричали, прогоняя того, кто стал вероятным убийцей Дунфана. О том, что предатель Дунфан умер, было доложено его бывшим соратникам по секте. Глава повелевает членам секты начать уничтожение демонов. У Нангун возникают проблемы с убийцей Дунфана.</div>
                </div>
            </div>
        </div>
        <div class="clear"></div>
        <article>
            <div class="container">
                <h1>Article title</h1>
                <div class="article-img"><img src="assets/img/post.webp" alt="article image"></div>
                <div class="article-info">
                    <div>Author: Stas Asket</div>
                    <div>Date of publication: 15.02.2023</div>
                    <div class="container-short-text">
                        <div class="truncate-text">Content: Дунфан Сяньюнь имел за плечами богатую жуткую историю. Парень оказался в мире не просто боевых искусств, а ещё и магии. Он принимал Фэй Синя за брата по секте Беспечности, а тот повелся преступным образом, столкнувши Дунфана с горы, а тот не погиб. Он встретил невероятную девушку, заставившую его стать злодеем. Когда-то он ощущал, что настало его время стать крутым, как всегда и мечтал. Он даже полагал, что станет рулить важной сектой. Никто не мог ему помочь. Он был загнан в угол. Ему не удалось победить главу семьи на высочайшем уровне духовного развития. В общем-то, проблем у парня было в избытке, и он уже подумал, что и в этот раз погибнет. Члены секты прибыли к городу, где находился штаб секты Соблазна. Нангун готова была к кардинальным мерам, но ответственный за миссию, сдерживает её пыл. Дунфан сталкивается с врагом. А тот был намного сильнее, и Дунфан пал наземь, а из домов стали выходить расстроенные люди, переживая за него. Они кричали, прогоняя того, кто стал вероятным убийцей Дунфана. О том, что предатель Дунфан умер, было доложено его бывшим соратникам по секте. Глава повелевает членам секты начать уничтожение демонов. У Нангун возникают проблемы с убийцей Дунфана.</div>
                    </div>
                </div>
            </div>
            <div class="clear"></div>
            <article>
                <div class="container">
                    <h1>Article title</h1>
                    <div class="article-img"><img src="assets/img/post.webp" alt="article image"></div>
                    <div class="article-info">
                        <div>Author: Stas Asket</div>
                        <div>Date of publication: 15.02.2023</div>
                        <div class="container-short-text">
                            <div class="truncate-text">Content: Дунфан Сяньюнь имел за плечами богатую жуткую историю. Парень оказался в мире не просто боевых искусств, а ещё и магии. Он принимал Фэй Синя за брата по секте Беспечности, а тот повелся преступным образом, столкнувши Дунфана с горы, а тот не погиб. Он встретил невероятную девушку, заставившую его стать злодеем. Когда-то он ощущал, что настало его время стать крутым, как всегда и мечтал. Он даже полагал, что станет рулить важной сектой. Никто не мог ему помочь. Он был загнан в угол. Ему не удалось победить главу семьи на высочайшем уровне духовного развития. В общем-то, проблем у парня было в избытке, и он уже подумал, что и в этот раз погибнет. Члены секты прибыли к городу, где находился штаб секты Соблазна. Нангун готова была к кардинальным мерам, но ответственный за миссию, сдерживает её пыл. Дунфан сталкивается с врагом. А тот был намного сильнее, и Дунфан пал наземь, а из домов стали выходить расстроенные люди, переживая за него. Они кричали, прогоняя того, кто стал вероятным убийцей Дунфана. О том, что предатель Дунфан умер, было доложено его бывшим соратникам по секте. Глава повелевает членам секты начать уничтожение демонов. У Нангун возникают проблемы с убийцей Дунфана.</div>
                        </div>
                    </div>
                </div>
                <div class="clear"></div>
                <article>
                    <div class="container">
                        <h1>Article title</h1>
                        <div class="article-img"><img src="assets/img/post.webp" alt="article image"></div>
                        <div class="article-info">
                            <div>Author: Stas Asket</div>
                            <div>Date of publication: 15.02.2023</div>
                            <div class="container-short-text">
                                <div class="truncate-text">Content: Дунфан Сяньюнь имел за плечами богатую жуткую историю. Парень оказался в мире не просто боевых искусств, а ещё и магии. Он принимал Фэй Синя за брата по секте Беспечности, а тот повелся преступным образом, столкнувши Дунфана с горы, а тот не погиб. Он встретил невероятную девушку, заставившую его стать злодеем. Когда-то он ощущал, что настало его время стать крутым, как всегда и мечтал. Он даже полагал, что станет рулить важной сектой. Никто не мог ему помочь. Он был загнан в угол. Ему не удалось победить главу семьи на высочайшем уровне духовного развития. В общем-то, проблем у парня было в избытке, и он уже подумал, что и в этот раз погибнет. Члены секты прибыли к городу, где находился штаб секты Соблазна. Нангун готова была к кардинальным мерам, но ответственный за миссию, сдерживает её пыл. Дунфан сталкивается с врагом. А тот был намного сильнее, и Дунфан пал наземь, а из домов стали выходить расстроенные люди, переживая за него. Они кричали, прогоняя того, кто стал вероятным убийцей Дунфана. О том, что предатель Дунфан умер, было доложено его бывшим соратникам по секте. Глава повелевает членам секты начать уничтожение демонов. У Нангун возникают проблемы с убийцей Дунфана.</div>
                            </div>
                        </div>
                    </div>
    </article>
<!--    <div class="clear"></div>-->
    <!-- Sidebar -->
    <section>
        <nav>
            <h2>Top articles</h2>
        </nav>
    </section>
</main>
<div class="clear">
<!-- Footer -->
<footer>
    Footer block
</footer>
<!-- Test -->

</body>
</html>
